Repository: pingfangx/TranslatorX
Catalog: JetBrains/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: Remove Configuration(s)
zh_cn: 移除配置

source: Remove Content Entry
zh_cn: 移除内容条目

source: Remove Content Root
zh_cn: 移除内容根目录

source: Remove Coverage Data
zh_cn: 移除覆盖率数据

source: Remove Duplicates
zh_cn: 移除重复的

source: Remove Enclosing Tag {0}
zh_cn: 移除封闭标记 {0}

source: Remove Filter
zh_cn: 移除过滤器

source: Remove From Current Favorites
zh_cn: 从当前收藏列表移除

source: Remove Line Breaks Before Tags
zh_cn: 在标签之前移除换行标记

source: Remove Meta Target
zh_cn: 移除元目标

source: Remove Meta Targets
zh_cn: 移除元目标对象

source: Remove Run Configuration
zh_cn: 移除运行配置

source: Remove Run Configuration(s)
zh_cn: 移除运行配置

source: Remove Selected
zh_cn: 移除所选

source: Remove Selected Elements
zh_cn: 移除所选元素

source: Remove Template
zh_cn: 移除模板

source: Remove User Defined Entry Points
zh_cn: 移除用户定义的入口点

source: Remove Watch
zh_cn: 移除观察点

source: Remove _Middleman...
zh_cn: 移除中间者...(_M)

source: Remove all splitters
zh_cn: 移除所有分割

source: Remove annotation
zh_cn: 移除注解

source: Remove attribute
zh_cn: 移除属性

source: Remove attribute {0}
zh_cn: 移除属性 {0}

source: Remove attribute/element
zh_cn: 移除属性/元素

source: Remove breakpoint
zh_cn: 移除断点

source: Remove breakpoint:
zh_cn: 移除断点：

source: Remove changelist and move all changes to another
zh_cn: 移除更改列表并将所有更改移动到其他更改列表

source: Remove changelist and move all changes to default
zh_cn: 移除更改列表并将所有更改移动到默认

source: Remove content root "{0}"?
zh_cn: 移除内容根目录 "{0}"？

source: Remove explicit array creation
zh_cn: 移除显式数组创建

source: Remove explicit type arguments
zh_cn: 移除显式的类型参数

source: Remove explicit type arguments of method reference
zh_cn: 移除方法引用的显式类型参数

source: Remove extra closing tag
zh_cn: 移除额外的结束标签

source: Remove field ''{0}''
zh_cn: 移除 字段 ''{0}''

source: Remove field initializer
zh_cn: 移除字段初始化

source: Remove from Entry Points
zh_cn: 从入口点移除

source: Remove from Sidebar
zh_cn: 从侧栏中移除

source: Remove from VCS
zh_cn: 从 VCS 移除

source: Remove generic parameter
zh_cn: 移除泛型参数

source: Remove it?
zh_cn: 移除它？

source: Remove new line before:
zh_cn: 移除之前的新行:

source: Remove parameter ''{0}''
zh_cn: 移除参数 ''{0}''

source: Remove parameter ''{0}'' no longer used
zh_cn: 移除不再使用的参数 ''{0}''

source: Remove qualifier
zh_cn: 移除限定符

source: Remove redundant arguments
zh_cn: 移除多余参数

source: Remove redundant arguments to call ''{0}''
zh_cn: 移除多余参数去调用 ''{0}''

source: Remove redundant assignment
zh_cn: 移除多余的赋值

source: Remove redundant call
zh_cn: 删除多余的调用

source: Remove redundant cast(s)
zh_cn: 移除多余的转换

source: Remove redundant chain call
zh_cn: 移除冗余链式调用

source: Remove redundant close
zh_cn: 移除多余的关闭

source: Remove redundant initializer
zh_cn: 移除多余的初始化

source: Remove rule(s)
zh_cn: 移除规则

source: Remove selected arrangement rule(s)
zh_cn: 移除选定的排列规则

source: Remove selected meta target(s)
zh_cn: 移除选定的元目标对象

source: Remove selected renderer
zh_cn: 移除选择的渲染器

source: Remove self assignment
zh_cn: 移除自身赋值

source: Remove suppression
zh_cn: 移除抑制

source: Remove tag
zh_cn: 移除标签

source: Remove tag {0}
zh_cn: 移除标签 {0}

source: Remove the current occurrence of the word from the selection.
zh_cn: 从选择中移除当前单词的匹配项。

source: Remove the selected build file from the list
zh_cn: 从列表中移除选定的构建文件

source: Remove this usage(s) from processing
zh_cn: 将这些使用移除进来

source: Remove tool window button from sidebar
zh_cn: 从侧边栏移除工具窗口按钮

source: Remove trailing comma
zh_cn: 移除尾随逗号

source: Remove underscores from literal
zh_cn: 从文字中移除下划线

source: Remove unnecessary throws declarations
zh_cn: 移除不必要的 throws 声明

source: Remove unused imports and reorder/reorganize imports
zh_cn: 移除未使用的导入并重新排序/重新组织导入

source: Remove unused namespace declaration
zh_cn: 移除未使用的命名空间声明

source: Remove unused parameter
zh_cn: 移除没有使用的参数

source: Remove unused variable
zh_cn: 移除没有使用的变量

source: Remove useless null-check
zh_cn: 移除无用的 null 检查

source: Remove variable ''{0}''
zh_cn: 移除变量 ''{0}''

source: Remove {0, choice, 1#1st|2#2nd|3#3rd|4#{0,number}th} parameter from method ''{1}''
zh_cn: 移除方法 ''{1}'' 的第 {0,number} 个参数

source: Remove {0, choice, 1#Library|2#Libraries}
zh_cn: 移除库

source: Remove {0, choice, 1#Module|2#Modules}
zh_cn: 移除模块

source: Remove {0,choice,0#changelist|2#changelists} and move all changes to {1}
zh_cn: 移除更改列表并将所有更改移动到 {1}

source: Remove {1, choice, 1#Module|2#Modules} {0} from the project?
zh_cn: 从项目中移除模块 {0} ?

source: Remove {1, choice, 1#module ''''{0}''''|2#{1} modules} from the project?
zh_cn: 从项目移除 {1, choice, 1#module ''''{0}''''|2#{1} 个模块} ?

source: Rename
zh_cn: 重命名

source: Rename &Directory
zh_cn: 重命名目录(&D)

source: Rename &Module
zh_cn: 重命名模块(&M)

source: Rename &all
zh_cn: 重命名全部(&A)

source: Rename &current
zh_cn: 重命名当前(&C)

source: Rename &directory
zh_cn: 重命名目录(&D)

source: Rename &inheritors
zh_cn: 重命名继承者(&I)

source: Rename &overloads
zh_cn: 重命名重载(&O)

source: Rename &package
zh_cn: 重命名包(&P)

source: Rename &project
zh_cn: 重命名项目(&P)

source: Rename &variables
zh_cn: 重命名变量(&V)

source: Rename ''{0}'' to ''{1}''
zh_cn: 将 ''{0}'' 重命名为 ''{1}''

source: Rename Bound Forms
zh_cn: 重命名绑定形式

source: Rename Constructor Parameters
zh_cn: 重命名构造函数参数

source: Rename Favorites List
zh_cn: 重命名收藏夹列表

source: Rename File
zh_cn: 重命名文件

source: Rename File Reference
zh_cn: 重命名文件参考

source: Rename File Reference to {0}
zh_cn: 重命名文件参考为 {0}

source: Rename File...
zh_cn: 重命名文件...

source: Rename Inheritors
zh_cn: 重命名继承者

source: Rename Library
zh_cn: 重命名库

source: Rename Macro
zh_cn: 重命名宏

source: Rename Module
zh_cn: 重命名模块

source: Rename Project
zh_cn: 重命名项目

source: Rename Project...
zh_cn: 重命名项目...

source: Rename Shelved Changelist
zh_cn: 重命名托管更改列表

source: Rename Tests
zh_cn: 重命名测试

source: Rename To
zh_cn: 重命名为

source: Rename Variables
zh_cn: 重命名变量

source: Rename Wrong Reference
zh_cn: 重命名错误的引用

source: Rename bound &forms
zh_cn: 重命名绑定表单(&F)

source: Rename class ''{0}'' to ''{1}''
zh_cn: 将类 ''{0}'' 重命名为 ''{1}''

source: Rename directories
zh_cn: 重命名目录

source: Rename directory
zh_cn: 重命名目录

source: Rename element
zh_cn: 重命名元素

source: Rename end tag ''{0}'' to ''{1}''
zh_cn: 将结束标签 ''{0}'' 重命名为 ''{1}''

source: Rename favorite list ''{0}'' to:
zh_cn: 重命名收藏夹列表 ''{0}'' 为:

source: Rename favorites list
zh_cn: 重命名收藏夹列表

source: Rename folder ''{0}''
zh_cn: 重命名文件夹 ''{0}''

source: Rename forms with the following names to:
zh_cn: 将具有以下名称的形式重命名为：

source: Rename implementation class to:
zh_cn: 重命名实现类为:

source: Rename inheritors with the following names to:
zh_cn: 将以下名称的继承者重命名为：

source: Rename inspection profile
zh_cn: 重命名检查配置文件

source: Rename module
zh_cn: 重命名模块

source: Rename original interface to:
zh_cn: 重命名原始接口为:

source: Rename parameters in hier&archy
zh_cn: 在层次结构中重命名参数(&A)

source: Rename parameters with the following names to:
zh_cn: 将以下名称的参数重命名为：

source: Rename reference
zh_cn: 重命名引用

source: Rename related files to:
zh_cn: 将相关文件重命名为：

source: Rename scope.
zh_cn: 重命名范围。

source: Rename selected file
zh_cn: 重命名选中文件

source: Rename shelved changelist
zh_cn: 重命名搁置更改列表

source: Rename start tag ''{0}'' to ''{1}''
zh_cn: 将起始标签 ''{0}'' 重命名为 ''{1}''

source: Rename t&ests
zh_cn: 重命名测试(&E)

source: Rename tests with the following names to:
zh_cn: 将以下名称的测试重命名为：

source: Rename the selected symbol and correct all references
zh_cn: 重命名选中符号并更正所有引用

source: Rename to
zh_cn: 重命名为

source: Rename variables with the following names to:
zh_cn: 将具有以下名称的变量重命名为：

source: Rename {0} Classes
zh_cn: 重命名 {0} 类

source: Rename {0} and its usages to:
zh_cn: 将 {0} 及其用法重命名为：

source: Rename {0} to:
zh_cn: 重命名 {0} 为:

source: Rename...
zh_cn: 重命名...

source: Renamed class will hide {0} in {1}
zh_cn: 重命名类将隐藏 {1} 中的 {0}

source: Renames project
zh_cn: 重命名项目

source: Renaming module {0}
zh_cn: 重命名模块 {0}

source: Renaming something
zh_cn: 重命名一些东西

source: Renaming {0}
zh_cn: 重命名 {0}

source: Renaming {0} {1} to {2}
zh_cn: 将 {0} {1} 重命名为 {2}

source: Renderer Reference Type
zh_cn: 渲染器引用类型

source: Renderer name:
zh_cn: 渲染器名字：

source: Reopen last project on startup
zh_cn: 在启动时重新打开上一个项目

source: Rep&lace &&Selected
zh_cn: 替换所选(&L)

source: Rep&lace write access occurrences
zh_cn: 替换写入的匹配项(&L)

source: Repeat the last Find/Replace operation in reverse direction, or moving to previous occurrence of selected text
zh_cn: 反方向重复上一次查找/替换操作，或移动到选中文本的上一个匹配项

source: Repeat the last Find/Replace operation, or moving to next occurrence of selected text
zh_cn: 重复上一次查找/替换操作，或移动到选中文本的下一个匹配项

source: Repeatable scope.
zh_cn: 重复的范围。

source: Repeated annotation target
zh_cn: 重复注解目标

source: Repl&ace All
zh_cn: 全部替换(&A)

source: Repl_ace in Path...
zh_cn: 在路径中替换...(_A)

source: Repla_ce Structurally...
zh_cn: 替换结构...(_C)

source: Replace
zh_cn: 替换

source: Replace &All
zh_cn: 全部替换(&A)

source: Replace &all occurrences
zh_cn: 替换所有的匹配项(&A)

source: Replace &all occurrences ({0} occurrences)
zh_cn: 重命名所有匹配项({0} 个匹配项)(&A)

source: Replace &all occurrences ({0})
zh_cn: 替换所有的匹配项 ({0})(&A)

source: Replace &with:
zh_cn: 替换为:(&W)

source: Replace ''{0}'' in {2} with ''{1}''
zh_cn: 在 {2} 中用 ''{1}'' 替换 ''{0}''

source: Replace ''{0}'' with ''{1}''
zh_cn: 用 ''{1}'' 替换 ''{0}''

source: Replace ''{0}()'' call with parametrized constructor call
zh_cn: 用参数化的构造函数调用替换 ''{0}()''

source: Replace ''{0}()'' with ''{1}()''
zh_cn: 用 with ''{1}()'' 替换 ''{0}()''

source: Replace '+' with 'java.text.MessageFormat.format()'
zh_cn: 用 'java.text.MessageFormat.format()' 替换 '+'

source: Replace 'addAll()/putAll()' call with parametrized constructor call
zh_cn: 用参数化的构造函数调用替换 'addAll()/putAll()'

source: Replace 'addAll/putAll' method with parametrized constructor call
zh_cn: 用参数化构造函数的调用替换 'addAll / putAll' 方法

source: Replace All
zh_cn: 全部替换

source: Replace All in This &File
zh_cn: 在此文件中替换全部(&F)

source: Replace By when using lookup
zh_cn: 在查找选项时使用替换

source: Replace Code Duplicates
zh_cn: 替换重复代码

source: Replace Concatenation with Formatted Output
zh_cn: 用格式化输出替换连接

source: Replace Constructor With Factory Method
zh_cn: 用工厂方法替换构造函数

source: Replace Constructor with Builder...
zh_cn: 用 Builder 代替构造函数...

source: Replace Constructor with F_actory Method...
zh_cn: 用工厂方法替换构造函数...(_A)

source: Replace Error
zh_cn: 替换错误

source: Replace Fragment
zh_cn: 替换片段

source: Replace Inheritance With Delegation
zh_cn: 用委托代替继承

source: Replace Structurally
zh_cn: 替换结构

source: Replace Temp with Query
zh_cn: 用查询代替 Temp

source: Replace Temp with _Query...
zh_cn: 用查询代替 Temp...(_Q)

source: Replace Text
zh_cn: 替换文本

source: Replace Usage {0} of {1} Found - {2}
zh_cn: 替换 {1} 的使用 {0} 找到 - {2}

source: Replace With Method Call does not work for constructors
zh_cn: 替换为方法调用不适用于构造函数

source: Replace _Inheritance with Delegation...
zh_cn: 用委托代替继承...(_I)

source: Replace a string in active editor with another string
zh_cn: 用另一个字符串替换当前编辑窗口中的字符串

source: Replace a string in multiple files with another string
zh_cn: 在多个文件中用一个字符串替换另一个字符串

source: Replace cast with variable
zh_cn: 用变量替换 cast

source: Replace condition with Objects.{0}
zh_cn: 用 Objects.{0} 替换条件

source: Replace condition with {0}
zh_cn: 用 {0} 替换条件

source: Replace constructor with factory method
zh_cn: 用工厂方法替换构造函数

source: Replace constructor {0} with a factory method
zh_cn: 用工厂方法替换构造函数 {0}

source: Replace current class constructors calls with chained calls to the builder
zh_cn: 用 builder 的链式调用替换当前类的构造函数调用

source: Replace default constructor of {0} with a factory method
zh_cn: 用工厂方法替换 {0} 的默认构造函数

source: Replace default constructor with factory method
zh_cn: 用工厂方法替换默认构造函数

source: Replace direct access to fields in the selected class with use of accessor methods
zh_cn: 使用访问器方法替换选中类中的字段的直接访问

source: Replace explicit argument with function
zh_cn: 用函数替换显式参数

source: Replace fields &inaccessible in usage context
zh_cn: 替换上下文没有使用的字段(&I)

source: Replace fields used in expressions with their getters
zh_cn: 使用字段的 getter 方法替换字段的使用

source: Replace in Find Window...
zh_cn: 在查找窗口中替换...

source: Replace in Path
zh_cn: 在路径中替换

source: Replace inheritance with delegation
zh_cn: 用委托代替继承

source: Replace instance qualifiers with class references
zh_cn: 用类引用替换实例限定符

source: Replace iteration with bulk ''{0}'' call
zh_cn: 用 bulk(批量) ''{0}'' 调用替换迭代

source: Replace lambda expression with ''{0}''
zh_cn: 用 ''{0}'' 替换 lambda 表达式

source: Replace lambda expression with method call
zh_cn: 用方法调用替换 lambda 表达式

source: Replace lambda with constant
zh_cn: 用常量替换 lambda

source: Replace loop with Arrays.setAll
zh_cn: 用 Arrays.setAll 替换循环

source: Replace module groups by prefixes added to module names
zh_cn: 将模块组替换为添加模块名称的前缀

source: Replace nested function call with andThen call
zh_cn: 用 andThen 调用替换嵌套函数调用

source: Replace nested function call with composition
zh_cn: 用组合替换嵌套函数调用

source: Replace null check with Objects/Stream static call
zh_cn: 用对象/流静态调用替换 null 检查

source: Replace selected expression with a constant (static final field)
zh_cn: 用常量(static final 字段)替换选中表达式

source: Replace selected statements with a call to a new functional method parameter
zh_cn: 通过调用新的 functional 方法参数来替换选中语句

source: Replace selected statements with a call to a new functional variable
zh_cn: 通过调用新的 functional 变量来替换选中语句

source: Replace selected statements with a call to new functional method parameter
zh_cn: 通过调用新的功能方法参数来替换选中语句

source: Replace the loop with Collection.removeIf
zh_cn: 用 Collection.removeIf 替换循环

source: Replace this code fragment?
zh_cn: 替换此代码片段？

source: Replace with != null
zh_cn: 替换为 != null

source: Replace with ''Objects.requireNonNull({0})''
zh_cn: 用 ''Objects.requireNonNull({0})'' 替换

source: Replace with ''{0} != null ?:''
zh_cn: 替换为 ''{0} != null ?:''

source: Replace with ''{0}''
zh_cn: 替换为 ''{0}''

source: Replace with ''{0}'' method call
zh_cn: 用 ''{0}'' 方法调用

source: Replace with ''{0}.{1}'' call
zh_cn: 用 ''{0}.{1}'' 调用替换

source: Replace with CSS
zh_cn: 用 CSS 替换

source: Replace with List.sort
zh_cn: 替换为 List.sort

source: Replace with Map.forEach
zh_cn: 替换为 Map.forEach

source: Replace with a null check
zh_cn: 替换为 null 检查

source: Replace with actual file template
zh_cn: 替换为实际文件模板

source: Replace with another tag
zh_cn: 用另一个标签替换

source: Replace with bulk method call
zh_cn: 用 bulk(批量) 方法调用替换

source: Replace with collection factory call
zh_cn: 用集合工厂调用替换

source: Replace with empty Optional method
zh_cn: 用空 Optional 方法替换

source: Replace with lambda returning ''{0}''
zh_cn: 用返回 ''{0}'' 的 lambda 替换

source: Replace with list access
zh_cn: 替换为列表访问

source: Replace with null-checking lambda
zh_cn: 用空检查的 lambda 替换

source: Replace with single Map method call
zh_cn: 替换为单个 Map 方法调用

source: Replace with trivial lambda
zh_cn: 用琐碎的 lambda 替换

source: Replace {0} tag with CSS
zh_cn: 用 CSS 替换 {0} 标签

source: Replace {0} tag with {1} tag
zh_cn: 替换标签 {0} 为 {1}

source: Replacement code
zh_cn: 替换代码

source: Replacement is not supported for {0} file type
zh_cn: {0} 文件类型不支持替换

source: Replacement of expression is not supported for {0}
zh_cn: {0} 不支持替换表达式

source: Replacement template:
zh_cn: 替换模板：

source: Replacement variable {0} has script code problem {1}
zh_cn: 替换变量 {0} 具有脚本代码问题 {1}

source: Replacement variable {0} is not defined.
zh_cn: 替换变量 {0} 未定义。

source: Replaces method parameters list with object
zh_cn: 用对象替换方法参数列表

source: Replace{0,choice,0#|1#|2# {0} Occurrences}
zh_cn: 替换{0,choice,0#|1#|2# {0} 匹配项}

source: Replacing inheritance with delegation
zh_cn: 委托替换继承

source: Replacing inheritance with delegation in {0}
zh_cn: 在 {0} 中用委托替换继承

source: Replacing it will overwrite its current contents.
zh_cn: 替换它将覆盖当前内容。

source: Replacing usages of {0} with {1}
zh_cn: 用 {1} 替换 {0} 的使用

source: Report &inconsistent properties
zh_cn: 报告不一致的属性(&I)

source: Report &missing translations
zh_cn: 报告缺少的翻译(&M)

source: Report ++i when may be replaced with (i + 1)
zh_cn: 换告 ++i 可以替换为 (i + 1)

source: Report Default file header
zh_cn: 报告默认文件头

source: Report catch parameters
zh_cn: 报告 catch 参数

source: Report classes
zh_cn: 报告类

source: Report default catch section
zh_cn: 报告默认 catch 部分

source: Report default created/overridden/implemented method body
zh_cn: 报告默认创建/覆盖/实现方法主体

source: Report fields
zh_cn: 报告字段

source: Report foreach parameters
zh_cn: 报告 foreach 参数

source: Report i++ when changed value is not used afterwards
zh_cn: 报告 i++ 改变后的值不被后面使用

source: Report local variables
zh_cn: 报告局部变量

source: Report method parameters
zh_cn: 报告方法参数

source: Report methods
zh_cn: 报告方法

source: Report non-&annotated parameters or methods overriding @NotNull
zh_cn: 报告未注解的参数或方法重写 @NotNull(&A)

source: Report non-annotated &setter parameters or getters of annotated fields
zh_cn: 报告非注解 setter 参数或注解字段的 getter(&S)

source: Report posting failed: {0}.
zh_cn: 报告发布失败:{0}。

source: Report properties &overridden with the same value
zh_cn: 使用相同值覆盖的属性(&O)

source: Report properties with inconsistent &ends
zh_cn: 报表结尾不一致的属性(&E)

source: Report properties with inconsistent &placeholders
zh_cn: 报告具有不一致占位符的属性(&P)

source: Report redundant initializers
zh_cn: 报告多余的初始化

source: Report to JetBrains
zh_cn: 报告给 JetBrains

source: Report use of deprecated features
zh_cn: 报告使用已弃用的功能

source: Report useless boxing in Stream.map
zh_cn: 在 Stream.map 中报告无用的装包

source: Report variables which are implicit final
zh_cn: 报告隐式 final 的变量

source: Report will include <a>{0} attachments</a>.
zh_cn: 报告将包括<a>{0} 附件</a>。

source: Report will include attachment: ''<a>{0}</a>''.
zh_cn: 报告将包括附件:''<a>{0}</a>''。

source: Repository History
zh_cn: 仓库历史

source: Repository URL:
zh_cn: 仓库 URL:

source: Required Javadoc is absent
zh_cn: 必需的 Javadoc 不存在

source: Required Tags
zh_cn: 必要的标签

source: Required connector ''{0}'' not found.
zh_cn: 未找到所需的连接器 ''{0}''。

source: Required parameters: <old_file> <new_file> [<delta_file_name>]
zh_cn: 必须的参数: <old_file> <new_file> [<delta_file_name>]

source: Required tag <code>@param</code> is missing for parameter {0}
zh_cn: 缺少参数 {0} 所需的 <code>@param</code> 标签

source: Required tag {0} is missing
zh_cn: 缺少必需的标签 {0}

source: Required {0, choice, 1#plugin|2#plugins} {1} {0, choice, 1#is|2#are} not enabled
zh_cn: 需要的插件 {1} 未启用

source: Required:\&nbsp;{0}
zh_cn: 需要:\&nbsp;{0}

source: Rerun
zh_cn: 重新运行

source: Rerun ''{0}''
zh_cn: 返回 ''{0}''

source: Rerun Dependency Analysis
zh_cn: 重新运行依赖分析

source: Rerun Failed Tests
zh_cn: 重新运行失败的测试

source: Rerun Inspection
zh_cn: 重新运行检查

source: Rerun in Debug Mode
zh_cn: 在调试模式中重新运行

source: Rerun search
zh_cn: 重新运行搜索

source: Rerun selected configuration(s)
zh_cn: 重新运行所选配置

source: Rerun selected configuration(s) in Debug Mode
zh_cn: 在调试模式中重新运行所选配置

source: Reset
zh_cn: 重置

source: Reset Font Size
zh_cn: 重置字体大小

source: Reset Template
zh_cn: 重置模板

source: Reset To Default
zh_cn: 重置为默认

source: Reset the scheme to its default values?
zh_cn: 将方案重置为默认值？

source: Reset to original template?
zh_cn: 重置为原始模板？

source: Resize
zh_cn: 调整大小

source: Resize active tool window to the bottom
zh_cn: 向底延伸活动工具窗口

source: Resize active tool window to the left
zh_cn: 向左延伸活动工具窗口

source: Resize active tool window to the right
zh_cn: 向右延伸活动工具窗口

source: Resize active tool window to the top
zh_cn: 向顶延伸活动工具窗口

source: Resize image to actual size
zh_cn: 调整图片为实际尺寸

source: Resolve
zh_cn: 解决

source: Resolve Automatically
zh_cn: 自动解决

source: Resolve Simple Conflicts
zh_cn: 处理简单冲突

source: Resolved value:
zh_cn: 解析值:

source: Resource Compiler
zh_cn: 资源编译器

source: Resource bundle &expression:
zh_cn: 资源包表达式：(&E)

source: Resource definition expected
zh_cn: 期望资源定义

source: Resource management
zh_cn: 资源管理

source: Resource management issues
zh_cn: 资源管理问题

source: Resource patterns:
zh_cn: 资源模式：

source: Resource references
zh_cn: 资源引用

source: Resource registered by this uri is not recognized (Settings | Languages \& Frameworks | Schemas and DTDs)
zh_cn: 由此 uri 注册的资源无法识别 (Settings | Languages \& Frameworks | Schemas and DTDs)

source: Restart
zh_cn: 重启

source: Restart Error
zh_cn: 重启错误

source: Restart Needed
zh_cn: 需要重新启动

source: Restart {1}?
zh_cn: 重启 {1}？

source: Restore
zh_cn: 恢复

source: Restore ''{0}'' View
zh_cn: 恢复 ''{0}'' 视图

source: Restore Applied Shelved Change
zh_cn: 恢复已应用的搁置更改

source: Restore De_fault Layout
zh_cn: 还原默认布局(_F)

source: Restore Default Extensions
zh_cn: 重置默认扩展名

source: Restore Defaults
zh_cn: 恢复默认值

source: Restore Defaults...
zh_cn: 恢复默认值...

source: Restore Layout
zh_cn: 恢复布局

source: Restore _Windows
zh_cn: 恢复窗口(_W)

source: Restore bundled extensions for this directory
zh_cn: 为此目录重置绑定的扩展名

source: Restore default layout
zh_cn: 还原默认布局

source: Restore default value
zh_cn: 重置默认值

source: Restore tool window size
zh_cn: 恢复工具窗口大小

source: Restore view in the debugger grid
zh_cn: 在调试器中恢复视图网格

source: Restore visual elements of debugger session to default state
zh_cn: 将调试器会话的可视元素恢复为默认状态

source: Restored
zh_cn: 恢复的

source: Result
zh_cn: 结果

source: Result options
zh_cn: 结果选项

source: Result schema file name
zh_cn: 结果 schema 文件名称

source: Result schema file name is empty
zh_cn: 结果 schema 文件名为空

source: Resulting code will not compile.
zh_cn: 结果代码将无法编译。

source: Results
zh_cn: 结果

source: Results By Editor Settings
zh_cn: 结果通过编辑器设置

source: Resume
zh_cn: 继续

source: Resume Pro_gram
zh_cn: 恢复程序(_G)

source: Resume only the current thread
zh_cn: 仅恢复当前线程

source: Resume program execution
zh_cn: 恢复程序执行

source: Retry
zh_cn: 重试

source: Return &type:
zh_cn: 返回类型:(&T)

source: Return outside method
zh_cn: 返回外部方法

source: Return separated from computation of result
zh_cn: 返回与结果计算分离

source: Return separated from computation of value of ''{0}''
zh_cn: 返回与 ''{0}'' 的计算结果分离

source: Return type ''{0}'' cannot be resolved.
zh_cn: 返回类型 ''{0}'' 无法解析。

source: Return type is 'void'
zh_cn: 返回类型是 'void'

source: Return type is not specified
zh_cn: 未指定返回类型

source: Return type of the method or type of the variable to be refactored should be boolean
zh_cn: 要重构的方法的返回值，或要重构的变量的类型，应该为布尔值

source: Return value of the method is never used
zh_cn: 方法的返回值是从未被使用过

source: Returned value is always 'null'
zh_cn: 返回类型总是 'null'

source: Returns:
zh_cn: 返回:

source: Reuse previous variable ''{0}'' declaration
zh_cn: 重用之前变量 ''{0}'' 声明

source: Reuse variable declaration
zh_cn: 重用变量声明

source: Revert
zh_cn: 还原

source: Revert Changes
zh_cn: 还原更改

source: Revert Selected Changes
zh_cn: 恢复所选的更改

source: Revert Selection
zh_cn: 还原所选

source: Revert selected changes
zh_cn: 还原选中更改

source: Revert: {0}
zh_cn: 恢复:{0}

source: Reverted to ''{0}'' at {1}
zh_cn: 还原为 ''{0}'' 在 {1}

source: Reverted to {0}
zh_cn: 已还原为 {0}

source: Revision
zh_cn: 修订

source: Revision {0}
zh_cn: 修订 {0}

source: Revision: {0}
zh_cn: 修订:{0}

source: Rich-text copy
zh_cn: 富文本复制

source: Right margin (columns):
zh_cn: 右边距(列):

source: Right part of the assignment is not a value
zh_cn: 赋值的右边部分不是一个值

source: Right with Selection
zh_cn: 向右选中

source: Right-clicking on a breakpoint (in the left gutter) invokes the context menu where you can quickly enable/disable the breakpoint or adjust its properties.
zh_cn: 右击一个断点标记(在左边的 gutter 上)调用上下文菜单，你可以快速启用/禁用断点或调整其属性。

source: Right-clicking on a breakpoint marker (on the bar to the left from the text) invokes the speedmenu where you can quickly enable/disable the breakpoint or adjust its properties.
zh_cn: 右击一个断点标记(在文本的左边栏上)调用快速菜单，你可以快速启用/禁用断点或调整其属性。

source: Right-to-Left
zh_cn: 右到左

source: Rinsert live template
zh_cn: 插入代码模板

source: Rlive templates
zh_cn: 代码模板

source: Rmodel diagram
zh_cn: 模型图

source: Rnavigate to rails
zh_cn: 导航到 rails

source: Rollback
zh_cn: 回滚

source: Rollback Change
zh_cn: 回滚更改

source: Rollback Changes
zh_cn: 回滚更改

source: Rollback File
zh_cn: 回滚文件

source: Rollback Lines
zh_cn: 回滚行

source: Rollback changes
zh_cn: 回滚更改

source: Rollback changes in selected lines
zh_cn: 回滚更改选中行

source: Rolling back {0}
zh_cn: 回滚 {0}

source: Root
zh_cn: 根

source: Root element for instance document generation
zh_cn: 生成实例文档的根元素

source: Root element name is not valid
zh_cn: 无效的根元素名称

source: Roots Switches
zh_cn: 根切换

source: Rrails generators popup
zh_cn: rails 生成器弹窗

source: Rrake popup
zh_cn: rake 弹窗

source: Rsurround with
zh_cn: 包围
